In [24]:
import pandas as pd
import pymysql
conn=pymysql.connect(host='localhost',port=int(3306),user='root',passwd='1234',db='learning_sql')
cursor = conn.cursor(pymysql.cursors.DictCursor)

### 연습용 Data 만들기

* desc : describe의 약자인듯

In [25]:
cursor.execute(' desc person')
result = cursor.fetchall()
pd.DataFrame(result)

         Field                  Type Null  Key Default           Extra
0    person_id     smallint unsigned   NO  PRI    None  auto_increment
1        fname           varchar(20)  YES         None
2        lname           varchar(20)  YES         None
3    eye_color  enum('BR','BL','GR')  YES         None
4   birth_date                  date  YES         None
5       street           varchar(30)  YES         None
6         city           varchar(20)  YES         None
7        state           varchar(20)  YES         None
8      country           varchar(20)  YES         None
9  postal_code           varchar(20)  YES         None

In [30]:
sen = ''' 

DESC favorite_food

'''
cursor.execute(sen)
result = cursor.fetchall()
pd.DataFrame(result)

       Field               Type Null  Key Default Extra
0  person_id  smallint unsigned   NO  PRI    None
1       food        varchar(20)   NO  PRI    None

### populating and modifying tables
* insert statement로 row를 추가한다.

* insert에 들어가지 않았거나 수정하려면 update statement를 쓴다.

In [29]:
sen ='''SELECT * FROM person'''

cursor.execute(sen)
result = cursor.fetchall()
pd.DataFrame(result)

,person_id,fname,lname,eye_color,birth_date,street,city,state,country,postal_code
0,6,William,Turner,BR,1972-05-27,None,None,None,None,None

In [31]:
sen = '''
INSERT INTO person
(person_id, fname, lname, eye_color, birth_date)
VALUES (null, 'William','Turner', 'BR', '1972-05-27');
'''

cursor.execute(sen)
result = cursor.fetchall()
conn.commit()

In [32]:
sen = '''
SELECT *
FROM person
'''

cursor.execute(sen)
result = cursor.fetchall()
pd.DataFrame(result)

,person_id,fname,lname,eye_color,birth_date,street,city,state,country,postal_code
0,6,William,Turner,BR,1972-05-27,None,None,None,None,None
1,7,William,Turner,BR,1972-05-27,None,None,None,None,None

### Table에서 원하는 column 불러오기
* SELECT columns_명 FROM table_명

In [35]:
sen = '''
SELECT *
FROM person
'''

cursor.execute(sen)
result = cursor.fetchall()
pd.DataFrame(result)

,person_id,fname,lname,eye_color,birth_date,street,city,state,country,postal_code
0,6,William,Turner,BR,1972-05-27,None,None,None,None,None
1,7,William,Turner,BR,1972-05-27,None,None,None,None,None

### 필터걸기
* Where 사용하면 필터를 걸 수 있다.

In [36]:
sen = '''
SELECT person_id, fname, lname, birth_date
FROM person
WHERE person_id = 6
'''

cursor.execute(sen)
result = cursor.fetchall()
pd.DataFrame(result)

   person_id    fname   lname  birth_date
0          6  William  Turner  1972-05-27

### ROW 추가하기
* INSERT INTO table (column) values (values)

In [43]:
data = [(6, 'pizza'),(6, 'cookies'),(6, 'nachos')]

sen = '''
INSERT INTO favorite_food (person_id, food) VALUES (%s, %s);
'''
cursor.executemany(sen,data)
result = cursor.fetchall()
pd.DataFrame(result)

Empty DataFrame
Columns: []
Index: []

In [46]:
sen = '''
SELECT food
FROM favorite_food
WHERE person_id = 6
ORDER BY food;
'''

cursor.execute(sen)
result = cursor.fetchall()
pd.DataFrame(result)

      food
0  cookies
1   nachos
2    pizza

In [48]:
sen = '''
INSERT INTO person
(person_id, fname, lname, eye_color, birth_date,
street, city, state, country, postal_code)
VALUES (null, 'Susan','Smith', 'BL', '1975-11-02',
'23 Maple St.', 'Arlington', 'VA', 'USA', '20220');
'''

cursor.execute(sen)
result = cursor.fetchall()
pd.DataFrame(result)

Empty DataFrame
Columns: []
Index: []

In [50]:
sen = '''
SELECT person_id, fname, lname, birth_date
FROM person
'''

cursor.execute(sen)
result = cursor.fetchall()
pd.DataFrame(result)
conn.commit()

In [54]:
sen = '''
UPDATE person
SET street = '1', 
city='boston',
country = 'USA',
postal_code = '02138'
WHERE person_id = 6
'''

cursor.execute(sen)
conn.commit()
result = cursor.fetchall()
pd.DataFrame(result)

Empty DataFrame
Columns: []
Index: []